<template>
    <div style="background-color:black; color:white">
        <v-flex>
            <v-card>
                <v-container d-flex flex-column justify-space-between>
                    <h1 class="text-center deep-purple--text mb-4" >Процесс сборки</h1>
                    <p>В данном разделе рассмотрен процесс сборки персонального компьютера. Данный алгоритм сборки персонального компьютера будет использован при разработке виртуального тренажера. Основные этапы сборки персонального компьютера подходят различной конфигурации аппаратного обеспечения персонального компьютера.
   В первую очередь, необходимо подготовить корпус (Системный блок). Снять с него обе боковые панели. Если это предусмотрено конструкцией – отсоединить отсек для крепления 3.5' накопителей. После примерки материнской платы и видеокарты – можно сразу удалить ненужные планки с задней панели корпуса. В зависимости от конфигурации системного блока – иногда может понадобиться отсоединить переднюю панель для последующей установки привода оптических дисков, передних вентиляторов и различных модулей с циферблатами. Вентиляторы устанавливаются сразу, остальное – позже. Иногда может потребоваться установить заднюю планку с отверстиями для разъемов тыльной стороны материнской платы (клавиатура, мышь, USB, LAN и тому подобные)
                    </p>
                    <v-img
                        class="align-self-stretch"
                        src="http://assembly-pc.narod.ru/images/a_pc/1.jpg"
                        max-height="450"
                        max-width="450"
                    ></v-img>
                    <p>Необходимо прочитать инструкцию к процессору и установить его (без системы охлаждения) на материнскую плату, пока она еще не в корпусе. Если в системе охлаждения предусмотрена подложка (металлическая пластина в форме креста или квадрата), то крепление всей системы охлаждения на процессор нужно будет производить до установки материнской платы в системный блок (стоит следовать инструкции, термопаста уже должна быть нанесена на нижнюю часть радиатора системы охлаждения – на то место, где будет происходить контакт с процессором)
                    </p>
                    <v-img
                        class="justify-start"
                        src="http://assembly-pc.narod.ru/images/a_pc/2.jpg"
                        max-height="450"
                        max-width="450"
                    ></v-img>
                    <p>Если подложка под систему охлаждения не предусмотрена – можно установить системную плату в корпус, или на специальную, съёмную пластину (если такая предусмотрена производителем системного блока). Для этого, в пакете в коробке с материнской платой, предусмотрено 6 винтов, которые в нижней части имеют наружную резьбу, а в верхней – внутреннюю. Их еще называют "Ножки". Крепко, но аккуратно, чтоб не сорвать резьбу, винты вкручиваются в отведенные отверстия на системном блоке, они должны совпадать отверстиями на материнской плате. К этим ножкам крепится сама плата (все нужные винты должны быть в пакете с ножками).
                    </p>
                    <v-img
                        class="justify-center"
                        src="http://assembly-pc.narod.ru/images/a_pc/3.jpg"
                        max-height="450"
                        max-width="450"
                    ></v-img>
                    <p>Далее желательно установить блок питания (БП). В основном, блок питания крепится к задней части корпуса (вверху или внизу - зависит от модели системного блока) четырьмя болтами, которые должны находиться в коробке с ним. При возможности провода от БП пропускаются через отведенные отверстия к предполагаемому месту подключения компонентов для того, чтоб они не занимали рабочее внутреннее пространство (для оптимизации дальнейшей сборки, обдува и эстетического восприятия).
                    </p>
                    <v-img
                        class="justify-center"
                        src="http://assembly-pc.narod.ru/images/a_pc/4.jpg"
                        max-height="450"
                        max-width="450"
                    ></v-img>
                    <p> Далее устанавливается система охлаждения на процессор. Для этого необходимо снять защитную пленку с нижней части радиатора, нанести термопасту (если не была нанесена производителем изначально) и тонким, равномерным слоем размазать по всей рабочей поверхности. Тонким слоем – означает, как можно тоньше, но чтоб не сильно проступал голый металл радиатора (допускается в одном - двух местах эффект "полупрозрачности" слоя термопасты). Все излишки аккуратно удаляются тряпочкой или салфеткой. Установка системы охлаждения производится, согласно пошаговой инструкции к процессору. 4 места крепления фиксируются в порядке по диагонали. Шнур питания от системы охлаждения подключается к материнской плате.
                    </p>
                    <v-img
                        class="justify-center"
                        src="http://assembly-pc.narod.ru/images/a_pc/5.jpg"
                        max-height="450"
                        max-width="450"
                    ></v-img>
                    <p>  Далее следует подсоединить провод для питания материнской платы(длинный, двухрядный разъем, находящийся в крайней левой части платы)и питание процессора(4-8-пиновый разъем, который обычно находится в верхней части платы, сразу над процессором). Оба провода имеют дополнительные язычки – защелки для более надежной фиксации. Следующий шаг – подсоединить провода от кулеров системного блока к разъемам на материнской плате. Стандартно они маркируются на самой плате как "Cha Fan1", "Cha Fan2" и так далее, что означает "ChasisFan" – Вентилятор шасси (корпуса). Обычно их 2-3 штуки. Если больше – остальные подключаются напрямую к блоку питания, но это в последнюю очередь. Иногда можно использовать еще разъем "PwrFan" (PowerFan), но обычно в BIOS нет возможности регулировать обороты вентилятора, подключенного к этому разъему.
                    </p>
                    <v-img
                        class="justify-center"
                        src="http://assembly-pc.narod.ru/images/a_pc/6.jpg"
                        max-height="450"
                        max-width="450"
                    ></v-img>
                    <p> Установка привода оптических дисков и накопителей. Лучше всего выбрать для них места, которые не будут препятствовать потоку воздуха от вентиляторов на корпусе, но и доступ шнуров питания тоже нужно учитывать. К установленным компонентам подключаются нужные провода от блока питания.
                    </p>
                    <v-img
                        class="justify-center"
                        src="http://assembly-pc.narod.ru/images/a_pc/7.jpg"
                        max-height="450"
                        max-width="450"
                    ></v-img>
                    <p> Далее устанавливаются планки оперативной памяти. Обычно в инструкции к материнской плате показано, в каком порядке и каких разъемах они должны быть установлены для максимальной скорости работы. В большинстве материнских плат два разных канала обозначены двумя цветами разъемов. В этом случае, планки нужно будет установить во все разъемы одного цвета.
                    </p>
                    <v-img
                        class="justify-center"
                        src="http://assembly-pc.narod.ru/images/a_pc/8.jpg"
                        max-height="450"
                        max-width="450"
                    ></v-img>
                    <p>    К материнской плате подключаются провода питания и контроля для элементов передней панели(USB, аудио, кнопки Power и Reset, пищалка в системном блоке и другие). В материнских платах разных производителей есть специальные переходники, упрощающие этот процесс (можно большинство мелких разъемов подсоединить к переходнику, а потом уже его подключить к мат. плате). Чтобы не допустить ошибок, следует следовать инструкции.
                    </p>
                    <v-img
                        class="justify-center"
                        src="http://assembly-pc.narod.ru/images/a_pc/9.jpg"
                        max-height="450"
                        max-width="450"
                    ></v-img>
                    <p>  После того, как все установлено и подключено – пора приступить к видеокарте. Для начала подготавливаются шнуры от блока питания (может потребоваться 1-2 шт. 6- или 8- пиновых разъемов). Некоторым видеокартам достаточно питания от разъема, к которому они подключаются – в таком случае никаких шнуров не потребуется. Устанавливается графическая карта в самый широкий горизонтальный разъем (их может быть несколько), который обычно подписан на самой материнской плате как "PCI-Ex16", что является укороченным названием от "PCI-Express x16". Это 16-пиновый разъем, использующийся специально для видеокарт. Сейчас используются два его поколения – 2.0 и 3.0, отличающиеся пропускной способностью. Видеокарта привинчивается в тыльную сторону к системному блоку (во многих корпусах для этого есть специальные зажимы).
                    </p>
                    <v-img
                        class="align-center"
                        block
                        src="http://assembly-pc.narod.ru/images/a_pc/10.jpg"
                        max-height="450"
                        max-width="450"
                    ></v-img>
                    <p> После установки всех компонентов еще раз надежность всех креплений. Ничего не должно болтаться и все проводы должны быть подключены. Корпус устанавливается в вертикальное положение, подключается сетевое питание, монитор и клавиатура. Далее включается рубильник на блоке питания, запускается компьютер. Если при включении компьютер издает характерный короткий одинарный сигнал, который означает удачное прохождение "POST" (все модули подключены верно), то ПК удачно собран.
                    </p>
                    <v-img
                        class="justify-center"
                        src="http://assembly-pc.narod.ru/images/a_pc/11.jpg"
                        max-height="450"
                        max-width="450"
                    ></v-img>
                    <p>
                        Если компьютер не прошел стадию самотестирования "POST"– следует отключить компьютер, и проверить правильность сборки.
                    </p>
                </v-container>
            </v-card>
        </v-flex>
    </div>
</template>

<style scoped>
p{
    padding-top: 20px;
    padding-bottom: 20px;
    font-family: Arial, Helvetica, sans-serif;
}

   
</style>